import string
dct = {'А':'A', 'а':'a', 'Ж':'Zh', 'ж':'zh',
       'Н':'N', 'н':'n', 'Ф':'F', 'ф':'f',
       'Ъ':'Ie', 'ъ':'ie', 'Б':'B', 'б':'b',
       'З':'Z', 'з':'z', 'О':'O', 'о':'o',
       'Х':'Kh', 'х':'kh', 'Э':'E', 'э':'e',
       'В':'V', 'в':'v', 'И':'I', 'и':'i',
       'П':'P', 'п':'p', 'Ц':'Ts', 'ц':'ts',
       'Ю':'Iu', 'ю':'iu', 'Г':'G', 'г':'g',
       'Й':'I', 'й':'i', 'Р':'R', 'р':'r',
       'Ч':'Ch', 'ч':'ch', 'Я':'Ia', 'я':'ia',
       'Д':'D', 'д':'d', 'К':'K', 'к':'k',
       'С':'S', 'с':'s', 'Ш':'Sh', 'ш':'sh',
       'Е':'E', 'е':'e', 'Л':'L', 'л':'l',
       'Т':'T', 'т':'t', 'Щ':'Shch', 'щ':'shch',
       'Ё':'E', 'ё':'e', 'М':'M', 'м':'m',
       'У':'U', 'у':'u', 'Ы':'Y', 'ы':'y',
       'ь':'', ' ':' '}


alf = string.ascii_lowercase